// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt("Введіть число"));

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// console.log(number);

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);

// let message;

// if (min >= 0 && min <= 14) {
//   message = `${min} входить в першу чверть`;
// } else if (min >= 15 && min <= 29) {
//   message = `${min} входить в другу чверть`;
// } else if (min >= 30 && min <= 44) {
//   message = `${min} входить в третю чверть`;
// } else {
//   message = `${min} входить в четверту чверть`;
// }

// alert(message);

// console.log(min);

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// const totalMinutes = Number(prompt("Введіть кількість хвилин"));

// function formatTime(totalMinutes) {
//     const hours = Math.floor(totalMinutes / 60);
//     const minutes = totalMinutes % 60;
//   return `${String(hours).padStart(2, '0')}:${String(minutes).padStart(2, '0')}`;
// }
// console.log(formatTime(totalMinutes));

// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.
// const num = prompt("Введіть число від 1 до 4");;
// let result;
// switch (num) {
//     case "1":
//         result = "зима";
//         break;
//     case "2":
//         result = "весна";
//         break;  
//     case "3":
//         result = "літо";
//         break;
//     case "4":
//         result = "осінь";
//         break;
//     default:
//         result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }
// console.log(result);

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// prompt("Введіть логін");
// const login = prompt("Введіть логін");

// if (login === "Адмін") {
//     const password = prompt("Введіть пароль");
//     if (password === "Я головний") {
//         alert("Добрий день!");
//     } else {
//         alert("Невірний пароль!");
//     }       
// } else if (login === null || login === "") {
//     alert("Скасовано");
// } else {
//     alert("Я вас не знаю");
// }    

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
let i = 0;
while (i <= 20) {
    console.log(i);
    i++;
}