// Напишии цикл, який виведе на консоль числа від 1 до 10.

let count = 1;

while (count <= 10) {
  console.log(`Count: ${count}`);
  count += 1;
}

// Напиши цикл, який виведе на консоль парні числа від 1 до 20.

for (let i = 1; i <=20; i +=1) {
    if (i %2 === 0) {
        console.log(i);
    }
}

// Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

let sum = 0;
for (let i = 1; i <=100; i +=1) {
    sum += i; 
    console.log(i);
}

// Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до 10).

for (let i = 1; i <= 10; i += 1) {
    console.log(`7 x ${i} = ${7 * i}`);
}


